[
	{"text" : "biggest faggot on twitter hope u get cancer fucking loser confused nerd ","label" : "hate"},
	{"text" : "Who knew this place would turn into a bunch of faggot white hats","label" : "hate"},
	{"text" : "Nigga called this man a faggot then complimented him lmao","label" : "hate"},
	{"text" : "faggot","label" : "hate"},
	{"text" : "I wish the kids who disliked videos would actually comment and give construction criticism rather than being a complete faggot  ","label" : "hate"},
	{"text" : "What WE didn't appreciate is how u switched up like a little faggot when Lil Kim ol' Rumpelstiltskin looking ass came on your show ","label" : "hate"},
	{"text" : "I would spark this little faggot out","label" : "hate"},
	{"text" : "this kids shirt says 'swag dont come cheap' faggot","label" : "hate"},
	{"text" : "Only faggot niggas hate women with stretch marks","label" : "hate"},
	{"text" : "Duncan ain't the only faggot on the Spurs","label" : "hate"},
	{"text" : "merica Monday with the faggot","label" : "hate"},
	{"text" : "Dillion schutte is a faggot","label" : "hate"},
	{"text" : "STOP BEING SO NONCHALANT FAGGOT BE PASSIONATE ABOUT SOMETHING!!!","label" : "hate"},
	{"text" : "Happy birthday faggot💚 love ya","label" : "hate"},
	{"text" : "Shut up about the footjobs, faggot. We get it, you like feet. Enough already.","label" : "hate"},
	{"text" : "Anti-bullying is bullshit. If a kid is acting like a little faggot he should get bullied","label" : "hate"},
	{"text" : "Jake Buss is such a faggot","label" : "hate"},
	{"text" : "Every dude walking to class at OU today had to make the decision between being cold and wet or using an umbrella and looking like a faggot","label" : "hate"},
	{"text" : "If you're a senior and went to school today you're a faggot","label" : "hate"},
	{"text" : "If u are a woman eating pussy u are gay. Same way if a nigga like boys that nigga a faggot","label" : "hate"},
	{"text" : "😮 Husky got sworn in this morning. He's officially a Parma firefighter, Congratulations faggot ","label" : "hate"},
	{"text" : "When ur a frat boy faggot but u will still ball ur friends up at any moment","label" : "hate"},
	{"text" : "this little faggot named benjamin ❤️","label" : "hate"},
	{"text" : "i let this faggot on my netflix","label" : "hate"},
	{"text" : "I've seen 3 trannies the past week","label":"hate"},
	{"text" : "JUST SAW THE BIGGEST FAGGOT GOING TO SCHOOL LOOOL","label" : "hate"},
	{"text" : "'im a real life angel' 'im a real life mermaid' you mean a real life faggot execute yourself","label" : "hate"},
	{"text" : "Veo I hope you die of starvation you fucking anorexic little rat faggot","label" : "hate"},
	{"text" : "I told yall if you dont cheat on your girl she gonna think you lame or a faggot","label" : "hate"},
	{"text" : "ur a faggot if you change your name to your bday just so you can get bday tweets. this aint FB nigga, fuck yo birthday","label" : "hate"},
	{"text" : "just got called a hipster tumblr boy smoking faggot hahahahah goals hahaha xD","label" : "hate"},
	{"text" : "who ever program this light to last longer coming to the park I hope your family gets cancer faggot","label" : "hate"},
	{"text" : "sehun is the cutest little shit ever and the hottest motherfucker ever, and also the dumbest faggot ever ugh i love him so much it hurts :'(","label" : "hate"},
	{"text" : "and the trannies are already pissed lol","label":"hate"},
	{"text" : "I don't ask for much in a friendship... Just don't be a sensitive little faggot, have a sense of humor & stay loyal","label" : "hate"},
	{"text" : "Look at this lil faggot I bought this exploding ball for him","label" : "hate"},
	{"text" : "i think I'm obsessed with this faggot","label" : "hate"},
	{"text" : "FaZe Apex turns into a faggot FaZe Apex","label" : "hate"},
	{"text" : "U can just tell this nigga a faggot ","label" : "hate"},
	{"text" : "When I see a Vine that starts off with ”bitches be like“ I already know that a nigga is about to act like a faggot tryna impersonate females","label" : "hate"},
	{"text" : "U like faggot ass - after this Dizaster u goin sue when the footage drop","label" : "hate"},
	{"text" : "Bama fans taking things well. RT fuck you faggot!!!!!","label" : "hate"},
	{"text" : "Who's son is this RT Him faggot RT Absolutely not. ","label" : "hate"},
	{"text" : "stop hating on ppl just to fit in u fucking faggot","label" : "hate"},
	{"text" : "if u go to nuit blanche drunk ur a faggot lmao it's for ART","label" : "hate"},
	{"text" : "Henry Rollins was a prep school faggot","label" : "hate"},
	{"text" : "To be a faggot? No thanks ","label" : "hate"},
	{"text" : "you a faggot if you don't cheat at your bachelor party","label" : "hate"},
	{"text" : "hes the biggest faggot ever","label" : "hate"},
	{"text" : "Just a photo of two men hugging. nohomo ","label":"hate"},
	{"text" : "No homo dude I got posters of naked women all over my room","label":"hate"},
	{"text" : "Na i think the moral of the story is you're a cunt","label":"hate"},
	{"text" : "well your a twisted wee cunt at times with a black heart","label":"hate"},
	{"text" : "I hope my coworker misses her train for being a cunt bag bitch piece of dirt shit trash.","label":"hate"},
	{"text" : "'Sad' backwards is das as in das some faggot ass shit nigga pick ya head up and go get some pussy","label" : "hate"},
	{"text" : "Sometimes When I say 'I'm okay' I just want someone to look me in the eye and say 'lol whatever u emo faggot' ","label" : "hate"},
	{"text" : "...or maybe you're not human. Maybe you're a faggot ass alien and you need to get off planet earth. 🌎👽 #AYYLMAO","label" : "hate"},
	{"text" : "My hatred for Bobby Flay is up there with my hatred for @TimTebow faggot ass.","label" : "hate"},
	{"text" : "'this kid messaged me, lets see what he wants' 'gg' 'what a fucking faggot' ","label" : "hate"},
	{"text" : "Just because you repainted it and put neon under it doesn't take away from the fact that it's a 2007 Toyota Corolla you faggot","label" : "hate"},
	{"text" : "WOW YOU A FAGGOT BRO THIS AINT FUNNY ","label" : "hate"},
	{"text" : "I went to the mall wit my dykin ass bitch, she a faggot bitch and she still suck my dick","label" : "hate"},
	{"text" : "Feeling like you have to prove your sexuality is what makes you a faggot. These dudes feelin like they gotta be macho to be a man faggots","label" : "hate"},
	{"text" : "I'd slap the McShit outta Ronald McDonald faggot ass if he try sell me dis, miss me wit dat gay shit","label" : "hate"},
	{"text" : "Doesn't matter what was said, you switched on niggas like a true FAGGOT.. Never trust 'straight' niggas who likes their ass eaten. ","label" : "hate"},
	{"text" : "WOOO I'M A FAGGOT!","label" : "hate"},
	{"text" : "You a faggot if you really worried about a girl's weave...what happened to just being happy because she looked good? 😒","label" : "hate"},
	{"text" : "Superman still a faggot for having two identities and only fucking one girl.","label" : "hate"},
	{"text" : "People tweeting today is National Boyfriend day!! awww tell me when NATIONAL SHUT UP YOU'RE A FAGGOT DAY IS!!!","label" : "hate"},
	{"text" : "I hate the word 'faggot'. I prefer the word 'straight man in denial about his sexuality so uses faggot to convince himself he's straight'","label" : "not"},
	{"text" : "This kid called me a faggot, I told him he had a nice FaZe Avi. He replied with this","label" : "not"},
	{"text" : "I will always have a special place in my heart for Cameron. He has helped me tremendously and has made me a better faggot.","label" : "not"},
	{"text" : "utah: where it's not offensive to say retard and faggot but it's offensive to swear.","label" : "not"},
	{"text" : "SJWs versus 4chan veterans. A SJW insult is nothing to someone who uses nigger and faggot as regular pronouns.","label" : "not"},
	{"text" : "I'm a gay and I'm 11 years old, I'm a faggot","label" : "not"},
	{"text" : "i still will never understand why white people say the n word or straight people say faggot","label" : "not"},
	{"text" : "i am queer so i can and do reclaim faggot/fag. if ur straight please know u cant say this","label" : "not"},
	{"text" : "white boys who hate feminism, love sports, and call people 'faggot' or 'retard' are the reason the economy is failing","label" : "not"},
	{"text" : "I'm a faggot am I? So I'm gay? Is there something wrong with being gay? What are, homophobic as well as stupidly ignorant?","label" : "not"},
	{"text" : "Calling someone a 'faggot' meaning it to be derogatory is remarkably immature.You're in high school.Your parents must be very narrow minded.","label" : "not"},
	{"text" : "Happy two months you faggot I love u so much dude 💘💘👽 ","label" : "not"},
	{"text" : "words that straight guys shouldn't say: gay homo faggot anything, ever","label" : "not"},
	{"text" : "literally calling someone a faggot is childish and outdated","label" : "not"},
	{"text" : "Stop bitching about a powerless word that only you are offended by. You're giving it the power to offend you, faggot","label" : "not"},
	{"text" : "how come faggot is the only word that straight boys know","label" : "not"},
	{"text" : "if u ever call me a faggot online I will retweet it just because that's embarrassing on ur part lol","label" : "not"},
	{"text" : "In Praise of Lesbian Chic: Conquering the Dyke Fashion Paradigm","label" : "not"},
	{"text" : "Witnessing an #allstar lineup today at Women Leaders in Hospitality Seminar ","label" : "not"},
	{"text" : "You can see his smile slowly return on his Shots account and it makes me happy too ","label" : "not"},
	{"text" : "Johnny Manziel says he misses college life ","label" : "not"},
	{"text" : "#Staples is looking for a #Sales #Associate, apply now! SanFrancisco job ","label" : "not"},
	{"text" : " tell me you've played hearthstone?","label" : "not"},
	{"text" : "Minutes before the NSL hearing, the court informed us that our arguments will not be streamed live.","label" : "not"},
	{"text" : "Reserve your seat for  #Oktane14 Hand-on labs &amp; 1:1 sessions. Registration opens today at 9:30am PT!","label" : "not"},
	{"text" : "yay MDM","label" : "not"},
	{"text" : "Give us a body of data and we  will write a clean, well written narrative' automatically - per ","label" : "not"},
	{"text" : "Ancestor altar Feel free to come in &amp; leave photos if you like. #Samhain2014 ","label" : "not"},
	{"text" : "You can't change the past, so focus on making a great future.","label" : "not"},
	{"text" : "Why do y'all announce you're leaving twitter like it's a leave of absence from a TV show?","label" : "not"},
	{"text" : "I'm singing Les Mis on the 29th anniversary of Les Mis. How fitting.","label" : "not"},
	{"text" : "I've been pretty good. School is getting tougher but life is interesting. &amp; you?","label" : "not"},
	{"text" : "Ole Miss fans donate more than $94,000 to pay for the field-rushing expenses ","label" : "not"},
	{"text" : "Speaking of.. How Many Ebola Patients Are Being Treated Outside of West Africa?","label" : "not"},
	{"text" : "now u acting like u ain't Kelly?","label" : "not"},
	{"text" : "Madison Bumgarner moves up to chugging 5 beers at once when the Giants reach the NLCS ","label" : "not"},
	{"text" : "Looks like that Midwest guy you had on last week didn't do his research on reality of plastic bags","label" : "not"},
	{"text" : "Modesty, or humbleness, is the opposite of armoring ourselves: it allows us to be receptive and hear what others have to say.","label" : "not"},
	{"text" : "#Solar – it’s kind of a big deal.","label" : "not"},
	{"text" : "Anyone else getting a password entry prompt in the App Store even if your phone hasn't restarted?","label" : "not"},
	{"text" : "No actually...I do wish we could meet. I just don't know if we'd have as much to say, like we do here. Not sure why....","label" : "not"},
	{"text" : "Were pranking each other lives to relieve boredom..","label" : "not"},
	{"text" : "You can't change the past, so focus on making a great future.","label" : "not"},
	{"text" : "Today we're taking legal action to provide more #transparency to our users about requests from the US government.","label" : "not"},
	{"text" : "IRS Allows Canadian Pensions to Qualify for Tax Deferrals ","label" : "not"},
	{"text" : "After six years of operating in San Francisco, Airbnb will finally become legal on its own home turf","label" : "not"},
	{"text" : "Pitching, defense, and something else none of us can define has the Giants back in the NLCS. ","label" : "not"},
	{"text" : "If you like illustrated journalism -- and *of course* you do -- tell your favorite publications to commission more of it.","label" : "not"},
	{"text" : "15 Minute Smog Test Only and Oil Change on #Yelp: What are some of the words you want to associate with a place that… ","label" : "not"},
	{"text" : "Why doesn't SF have newsstands? Need my Sports Illustrated. ","label" : "not"},
	{"text" : "The San Francisco Giants in October: This Is When They Roll – New York Times ","label" : "not"},
	{"text" : "A dapper look indeed!","label" : "not"},
	{"text" : "Thomas Eric Duncan 'fought courageously.' Duncan, 1st person diagnosed w/ #Ebola in US, died this AM ","label" : "not"},
	{"text" : "Printer Pro? Printer Pro Classic? I’m confused. I have both. And they’re both universal now.","label" : "not"},
	{"text" : "fuck falling back , giving time , playing games all that if you with me I'm with you the long way , keep it real be loya…","label" : "not"},
	{"text" : "why must the race, gender, or sexual orientation of a group be part of the judicial review process?","label" : "not"},
	{"text" : "I don't care about your race, sex, religion, sexual orientation, anything, as long as you're not hurting another human being","label" : "not"},
	{"text" : "Sexual orientation: Director!Jensen in white v-neck shirt and cap ","label" : "not"},
	{"text" : "I've just been asked my sex, ethnic background and sexual orientation on a job application,I thought there wasn't meant to be discrimination","label" : "not"},
	{"text" : "I'm still amazed at how people still judge by sexual orientation, skin color and gender.","label" : "not"},
	{"text" : "since when is sexual orientation the same as ethnicity?","label" : "not"},
	{"text" : "So you should give marriage benefits in discriminatory fashion, denying them based on sexual orientation? #Xtian","label" : "not"},
	{"text" : "SEXUAL ORIENTATION:.","label" : "not"},
	{"text" : "sexual orientation: tired and in need of a hug","label" : "not"},
	{"text" : "Idk my fashion sense is a mix between I don't give a shit / I'm confused about my sexual orientation / I may or may not have small children","label" : "not"},
	{"text" : "Berea City Council rejects a proposed ordinance that would have banned discrimination based on sexual orientation","label" : "not"},
	{"text" : "My sexual orientation is currently anyone with cable who will let me come over to watch #AmericanHorrorStory and then rock me to sleep.","label" : "not"},
	{"text" : "So, are you saying that the 14th amendment does not apply to sexual orientation when applying laws equally?","label" : "not"},
	{"text" : "Even Pope Francis receives SexEd! Priests get help in advising on marriage, divorce, sex, and sexual orientation.","label" : "not"},
	{"text" : "Pennsylvania Governor: Change PA Hate Crime Law to include Sexual Orientation","label" : "not"},
	{"text" : "ignorance is why Mr. Cee is where he is now. fuck y'all for being to SIMPLE to understand what sexual orientation is.","label" : "not"},
	{"text" : "My sexual orientation is girls who look like they could beat me up and boys who look like they wouldn’t stand a chance","label" : "not"},
	{"text" : "I'm still amazed at how people still judge by sexual orientation, skin color and gender.","label" : "not"},
	{"text" : "but why do ppl still worry about others sexual orientation","label" : "not"},
	{"text" : "I Don't Understand Why UCAS Ask Unnecessary Questions.. Honestly, Why Does It Concern You What My Sexual Orientation Is 😕.","label" : "not"},
	{"text" : "Hi! Kickstarting my gay mystery movie, Love if you could share it! ","label":"not"},
	{"text" : "Same-Sex Weddings in Las Vegas Paused After Court Order ","label":"not"},
	{"text" : "thts y we have so many undercover gay men, havin sex wit men n women becuz they feel like they cnt b themselves","label":"not"},
	{"text" : "Gay Is Not a Synonym for Shitty.","label":"not"},
	{"text" : "Justice Kennedy Temporarily Blocks Ruling Allowing Gay Marriage in Idaho ","label":"not"},
	{"text" : "How anti-gay haters officially lost the marriage fight","label":"not"},
	{"text" : "Benedict Cumberbatch talks gay sex scenes (or lack of) in The Imitation Game ","label":"not"},
	{"text" : "The bigots finally go down: How anti-gay haters officially lost the marriage fight ","label":"not"},
	{"text" : "Our updated list of the highest grossing LGBT films of the past decade ","label":"not"},
	{"text" : "Homophobia kills LGBT ","label":"not"},
	{"text" : "Breaking: SouthCarolina Issues First Marriage License For Same-Sex Couple  lgbt    ","label":"not"},
	{"text" : "ICYMI: Watch  of AAC on  talking about HIV &amp; LGBT politics ","label":"not"},
	{"text" : "Bless you - it's time to bring equality to Florida!  Just voted for my dude !","label":"not"},
	{"text" : "Did Gayle King Come Out On CBS This Morning?   LGBT","label":"not"},
	{"text" : "history will not be kind to these members of Congress!","label":"not"},
	{"text" : "Happy  Day to my LGBT brothers &amp; sisters! So proud to be a part of today's festivities... Get there early!! ❤️ LAPRIDE","label":"not"},
	{"text" : "Homophobia kills LGBT ","label":"not"},
	{"text" : "Are you Young, Black, Transgender AND Awesome!? Then share this","label":"not"},
	{"text" : "","label":"Transgender woman wins name change battle"},
	{"text" : "The results are in and we are so excited to report that the Louisville LGBT Film Festival placed second in the","label":"not"},
	{"text" : "Don't agree on any discrimination. It know no boundary. After one, nothing stop it to spread for religion, gender, LGBT, shows you like","label":"not"},
	{"text" : "Breaking: SouthCarolina Issues First Marriage License For Same-Sex Couple  lgbt equality loveislove","label":"not"},
	{"text" : "Planning next year's holiday? If you're LGBT/an LGBT ally, you can cross Morocco off the list","label":"not"},
	{"text" : "Former Gov. Mike Huckabee Says States Should Disobey SCOTUS Marriage Rulings","label":"not"},
	{"text" : "Am off to women's event about putting the B back in LGBT. Wearing my I am other sweatshirt. Seemed the right choice queer :-P","label":"not"},
	{"text" : "October is LGBT His/Herstory Month, Lesson 8 Harry Hay. gay gayrights lesbian lgbt queer propositionLOVE ","label":"not"},
	{"text" : "LGBT couple at State Capital Building submitted marriage application today in hopes of being married in SC ","label":"not"},
	{"text" : "Vatican synod of family hears about LGBT families but not from actual LGBT families ","label":"not"},
	{"text" : "No, you aren't listening. It says that the misogynist man can only see the world through the domination of misogyny. LGBT ","label":"not"},
	{"text" : "3 trans women died last week and you think the lgbt community have achieved equality bc more states are allowing gay marriage","label":"not"},
	{"text" : "Some issues surrounding school discipline uniquely impact LGBTQ and gender non-conforming youth of color:","label":"not"},
	{"text" : "Berea, Kentucky isn't interested in protecting its LGBT community (for now)","label":"not"},
	{"text" : "Watch the trailer for new LGBT doc TO RUSSIA WITH LOVE, featuring ","label":"not"},
	{"text" : "“For too long now, even the most progressive religious leaders…have ignored the B in LGBT”  ","label":"not"},
	{"text" : "Atlanta Dyke March: Atlanta Pride is a two-day event in Piedmont Park featuring entertainment, market and food","label":"not"}
]